src/C-C++/C FAQ Notes.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: C FAQ Notes
#+OPTIONS: num:nil H:2
Offical Site: http://c-faq.com/

* 1. Declarations and Initializations
** Q1.1 How should I decide which integer type to use?
 Under ANSI C, the maximum and minimum values for a particular machine
 can be found in the header file <limits.h>; here is a summary:
#+begin_src c
Base type	Minimum size (bits)	Minimum value (signed)	Maximum value (signed)	Maximum value (unsigned)
char	8	-127	127	255
short	16	-32,767	32,767	65,535
int	16	-32,767	32,767	65,535
long	32	-2,147,483,647	2,147,483,647	4,294,967,295

sizeof(char) <= sizeof(short) <= sizeof(int) <= sizeof(long) <= sizeof(long long)
#+end_src

** Q1.3 You no longer have to define your own typedefs, because the Standard header <inttypes.h> contains a complete set.
The file path: =/usr/include/inttypes.h=.

The =inttypes.h= file is a C header file that is part of the C standard
library and API. It was added with the 1999 version of the ISO C
standard (known as C99). It includes the stdint.h header and defines a
number of macros for using it with the =printf= and =scanf= family of
functions, as well as functions for working with the intmax_t type.[fn:1]

*** Naming Convention and format specifiers for Macros
The macros defined in inttypes.h follow a regular pattern to simplify
usage. The pattern followed is as follows:

+ First three characters
 - PRI for output format (printf, fwprintf, wprintf, etc.)
 - SCN for input format (scanf, fwscanf, etc.)
+ Fourth character
 - d for decimal formatting
 - x for hexadecimal formatting
 - o for octal formatting
 - u for unsigned int formatting
 - i for integer formatting
+ Remaining Characters
 - N for N bit size assignment to the data type (Eg. 32 for 32-bit size for integer, 16 for 16-bit size for unsigned int and so on)
 - PTR for pointer
 - MAX for maximum supported bit size
 - FAST, whose meaning is not clearly defined and is left to the implementation to decide what is meant by a "fast" integer data type.






Question 2.25
bit-fields; 
http://publications.gbdirect.co.uk/c_book/chapter6/bitfields.html
http://www.linuxforu.com/2012/01/joy-of-programming-understanding-bit-fields-c/
http://en.wikipedia.org/wiki/Single_precision

** Q1.10 Do all declarations for the same static function or variable have to include the storage class static?
Additional links: An [[http://c-faq.com/decl/static.jd.html][article by Jutta Degener]] explaining the subtly
different rules for static variables versus static functions.

Example:
#+begin_src c
/* object */	  /* function */

int o1;		  int f1();		/* external linkage */
static int o2;	  static int f2();	/* internal linkage */
static int o3;	  static int f3();	/* internal linkage */

static int o1;	  static int f1();	/* ERROR, both have external linkage */
int o2;					/* ERROR, o2 has internal linkage */
		  int f2();		/* OK, picks up internal linkage */
extern int o3;	  extern int f3();	/* OK, both pick up internal linkage */
#+end_src
The difference is case (2); where functions do pick up a previous
linkage even without "extern", objects don't.
 
** Q1.20b What does it mean for a function parameter to be const? What do the two const's in
=int f(const * const p)= mean?

The first of the two const's is perfectly appropriate and quite
useful; many functions declare parameters which are pointers to const
data, and doing so documents (and tends to enforce) the function's
promise that it won't modify the pointed-to data in the caller. The
second const, on the other hand, is almost useless; all it says is
that the function won't alter its own copy of the pointer, even though
it wouldn't cause the caller or the function any problems if it did,
nor is this anything the caller should care about in any case. The
situation is the same as if a function declared an ordinary
(non-pointer) parameter as const:

	=int f2(const int x)=
This says that nowhere in the body of f2() will the function assign a
different value to x. 
