src/C-C++/C FAQ Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C FAQ Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="C FAQ Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-12 12:34:52 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">C FAQ Notes</h1>

<p>Offical Site: <a href="http://c-faq.com/">http://c-faq.com/</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Declarations and Initializations</a>
<ul>
<li><a href="#sec-1-1">Q1.1 How should I decide which integer type to use?</a></li>
<li><a href="#sec-1-2">Q1.3 You no longer have to define your own typedefs, because the Standard header &lt;inttypes.h&gt; contains a complete set.</a></li>
<li><a href="#sec-1-3">Q1.10 Do all declarations for the same static function or variable have to include the storage class static?</a></li>
<li><a href="#sec-1-4">Q1.20b What does it mean for a function parameter to be const? What do the two const's in</a></li>
<li><a href="#sec-1-5">Q1.21  How do I construct declarations of complicated types such as ``array of N pointers to functions returning pointers to functions returning pointers to char'', or figure out what similarly complicated declarations mean?</a></li>
<li><a href="#sec-1-6">Q1.29 How can I determine which identifiers are safe for me to use and which are reserved?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Structures, Unions, and Enumerations</a>
<ul>
<li><a href="#sec-2-1">Q2.6  I came across some code that declared a structure like this:</a></li>
<li><a href="#sec-2-2">Q2.10 How can I pass constant values to functions which accept structure arguments? How can I create nameless, immediate, constant structure values?</a></li>
<li><a href="#sec-2-3">Q2.11 How can I read/write structures from/to data files?</a></li>
<li><a href="#sec-2-4">Q2.12 Why is my compiler leaving holes in structures, wasting space and preventing ``binary'' I/O to external data files? Can I turn this off, or otherwise control the alignment of structure fields?</a></li>
<li><a href="#sec-2-5">Q2.14 How can I determine the byte offset of a field within a structure?</a></li>
<li><a href="#sec-2-6">Q2.21 Is there an automatic way to keep track of which field of a union is in use?</a></li>
<li><a href="#sec-2-7">Q2.25 I came across some structure declarations with colons and numbers next to certain fields, like this:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Expressions</a>
<ul>
<li><a href="#sec-3-1">Q</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1. Declarations and Initializations</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Q1.1 How should I decide which integer type to use?</h3>
<div class="outline-text-3" id="text-1-1">

<p> Under ANSI C, the maximum and minimum values for a particular machine
 can be found in the header file &lt;limits.h&gt;; here is a summary:
</p>


<pre class="src src-c">Base type       <span style="color: #98fb98;">Minimum</span> <span style="color: #87cefa;">size</span> (bits)     <span style="color: #98fb98;">Minimum</span> <span style="color: #87cefa;">value</span> (<span style="color: #98fb98;">signed</span>)  <span style="color: #98fb98;">Maximum</span> <span style="color: #87cefa;">value</span> (<span style="color: #98fb98;">signed</span>)  <span style="color: #98fb98;">Maximum</span> <span style="color: #87cefa;">value</span> (<span style="color: #98fb98;">unsigned</span>)
<span style="color: #98fb98;">char</span>    8       -127    127     255
<span style="color: #98fb98;">short</span>   16      -32,767 32,767  65,535
<span style="color: #98fb98;">int</span>     16      -32,767 32,767  65,535
<span style="color: #98fb98;">long</span>    32      -2,147,483,647  2,147,483,647   4,294,967,295

<span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">char</span>) &lt;= <span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">short</span>) &lt;= <span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">int</span>) &lt;= <span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">long</span>) &lt;= <span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">long</span> <span style="color: #98fb98;">long</span>)
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Q1.3 You no longer have to define your own typedefs, because the Standard header &lt;inttypes.h&gt; contains a complete set.</h3>
<div class="outline-text-3" id="text-1-2">

<p>The file path: <code>/usr/include/inttypes.h</code>.
</p>
<p>
The <code>inttypes.h</code> file is a C header file that is part of the C standard
library and API. It was added with the 1999 version of the ISO C
standard (known as C99). It includes the stdint.h header and defines a
number of macros for using it with the <code>printf</code> and <code>scanf</code> family of
functions, as well as functions for working with the intmax<sub>t</sub> type.<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>
</p>
<ul>
<li id="sec-1-2-1">Naming Convention and format specifiers for Macros<br/>
The macros defined in inttypes.h follow a regular pattern to simplify
usage. The pattern followed is as follows:

<ul>
<li>First three characters
<ul>
<li>PRI for output format (printf, fwprintf, wprintf, etc.)
</li>
<li>SCN for input format (scanf, fwscanf, etc.)
</li>
</ul>

</li>
<li>Fourth character
<ul>
<li>d for decimal formatting
</li>
<li>x for hexadecimal formatting
</li>
<li>o for octal formatting
</li>
<li>u for unsigned int formatting
</li>
<li>i for integer formatting
</li>
</ul>

</li>
<li>Remaining Characters
<ul>
<li>N for N bit size assignment to the data type (Eg. 32 for 32-bit size for integer, 16 for 16-bit size for unsigned int and so on)
</li>
<li>PTR for pointer
</li>
<li>MAX for maximum supported bit size
</li>
<li>FAST, whose meaning is not clearly defined and is left to the implementation to decide what is meant by a "fast" integer data type.
</li>
</ul>

</li>
</ul>







<p>
Question 2.25
bit-fields; 
<a href="http://publications.gbdirect.co.uk/c_book/chapter6/bitfields.html">http://publications.gbdirect.co.uk/c_book/chapter6/bitfields.html</a>
<a href="http://www.linuxforu.com/2012/01/joy-of-programming-understanding-bit-fields-c/">http://www.linuxforu.com/2012/01/joy-of-programming-understanding-bit-fields-c/</a>
<a href="http://en.wikipedia.org/wiki/Single_precision">http://en.wikipedia.org/wiki/Single_precision</a>
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Q1.10 Do all declarations for the same static function or variable have to include the storage class static?</h3>
<div class="outline-text-3" id="text-1-3">

<p>Additional links: An <a href="http://c-faq.com/decl/static.jd.html">article by Jutta Degener</a> explaining the subtly
different rules for static variables versus static functions.
</p>
<p>
Example:
</p>


<pre class="src src-c"><span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">object </span><span style="color: #ff7f24;">*/</span>      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">function </span><span style="color: #ff7f24;">*/</span>

<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o1</span>;           <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f1</span>();             <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">external linkage </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o2</span>;    <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f2</span>();      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">internal linkage </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o3</span>;    <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f3</span>();      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">internal linkage </span><span style="color: #ff7f24;">*/</span>

<span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o1</span>;    <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f1</span>();      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">ERROR, both have external linkage </span><span style="color: #ff7f24;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o2</span>;                                 <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">ERROR, o2 has internal linkage </span><span style="color: #ff7f24;">*/</span>
                  <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f2</span>();             <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">OK, picks up internal linkage </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">extern</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">o3</span>;    <span style="color: #00ffff;">extern</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">f3</span>();      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">OK, both pick up internal linkage </span><span style="color: #ff7f24;">*/</span>
</pre>

<p>
The difference is case (2); where functions do pick up a previous
linkage even without "extern", objects don't.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Q1.20b What does it mean for a function parameter to be const? What do the two const's in</h3>
<div class="outline-text-3" id="text-1-4">

<p><code>int f(const * const p)</code> mean?
</p>
<p>
The first of the two const's is perfectly appropriate and quite
useful; many functions declare parameters which are pointers to const
data, and doing so documents (and tends to enforce) the function's
promise that it won't modify the pointed-to data in the caller. The
second const, on the other hand, is almost useless; all it says is
that the function won't alter its own copy of the pointer, even though
it wouldn't cause the caller or the function any problems if it did,
nor is this anything the caller should care about in any case. The
situation is the same as if a function declared an ordinary
(non-pointer) parameter as const:
</p>
<p>
        <code>int f2(const int x)</code>
This says that nowhere in the body of f2() will the function assign a
different value to x. 
</p></div>

</div>
