src/C-C++/C FAQ Notes.org
** Q1.21  How do I construct declarations of complicated types such as ``array of N pointers to functions returning pointers to functions returning pointers to char'', or figure out what similarly complicated declarations mean?

1. =char *(*(*a[N])())();=
Build the declaration up incrementally, using =typedefs=:
#+begin_src c 
	typedef char *pc;       /* pointer to char */
	typedef pc fpc();	/* function returning pointer to char */
	typedef fpc *pfpc;	/* pointer to above */
	typedef pfpc fpfpc();	/* function returning... */
	typedef fpfpc *pfpfpc;	/* pointer to... */
	pfpfpc a[N];		/* array of... */
#+end_src
Use the *cdecl* program, which turns English into C and vice versa.
You provide a longhand description of the type you want, and cdecl
responds with the equivalent C declaration:
#+begin_src sh
	cdecl> declare a as array of pointer to function returning
		pointer to function returning pointer to char

	char *(*(*a[])())()
#+end_src
 *cdecl* can also explain complicated declarations (you give it a
complicated declaration and it responds with an English description),
help with casts, and indicate which set of parentheses the parameters
go in (for complicated function definitions, like the one above).

One way to make sense of complicated C declarations is by reading them
``inside out,'' remembering that [] and () bind more tightly than *.
For example, given

	=char *(*pfpc)();=

we can see that pfpc is a pointer (the inner *) to a function (the ())
to a pointer (the outer *) to char. When we later use pfpc, the
expression *(*pfpc)() (the value pointed to by the return value of a
function pointed to by pfpc) will be a char.

Another way of analyzing these declarations is to decompose the
declarator while composing the description, maintaining the
``declaration mimics use'' relationship: 
#+begin_src c
	*(*pfpc)()	is a	char
	(*pfpc)()	is a	pointer to char
	(*pfpc)	is a	function returning pointer to char
	pfpc	is a	pointer to function returning pointer to char
#+end_src
If you'd like to make things clearer when declaring complicated types
	like these, you can make the analysis explicit by using a
	chain of typedefs as in option 2 above.
 *Additional links:*
David Anderson's [[http://c-faq.com/decl/spiral.anderson.html][``Clockwise/Spiral Rule'']]

There is a technique known as the ``Clockwise/Spiral Rule'' which
enables any C programmer to parse in their head any C declaration!

There are three simple steps to follow:

1. Starting with the unknown element, move in a spiral/clockwise direction; when ecountering the following elements replace them with the corresponding english statements:
[X] or []
=> Array X size of... or Array undefined size of...
(type1, type2)
=> function passing type1 and type2 returning...
=*=
=> pointer(s) to...
2. Keep doing this in a spiral/clockwise direction until all tokens have been covered.
3. Always resolve anything in parenthesis first!
 *Example #1: Simple declaration*
#+begin_src sh
                     +-------+
                     | +-+   |
                     | ^ |   |
                char *str[10];
                 ^   ^   |   |
                 |   +---+   |
                 +-----------+
#+end_src
Question we ask ourselves: What is str?

``str is an...
+ We move in a spiral clockwise direction starting with `str' and the first character we see is a `[' so, that means we have an array, so...
``str is an array 10 of...
+ Continue in a spiral clockwise direction, and the next thing we encounter is the `*' so, that means we have pointers, so...
``str is an array 10 of pointers to...
+ Continue in a spiral direction and we see the end of the line (the `;'), so keep going and we get to the type `char', so...
``str is an array 10 of pointers to char''
+ We have now ``visited'' every token; therefore we are done!
 *Example #2: Pointer to Function declaration*
#+begin_src c
                     +--------------------+
                     | +---+              |
                     | |+-+|              |
                     | |^ ||              |
                char *(*fp)( int, float *);
                 ^   ^ ^  ||              |
                 |   | +--+|              |
                 |   +-----+              |
                 +------------------------+
#+end_src 
Question we ask ourselves: What is fp?

``fp is a...
+ Moving in a spiral clockwise direction, the first thing we see is a `)'; therefore, fp is inside parenthesis, so we continue the spiral inside the parenthesis and the next character seen is the `*', so...
``fp is a pointer to...
+ We are now out of the parenthesis and continuing in a spiral clockwise direction, we see the `('; therefore, we have a function, so...
``fp is a pointer to a function passing an int and a pointer to float returning...
+ Continuing in a spiral fashion, we then see the `*' character, so...
``fp is a pointer to a function passing an int and a pointer to float returning a pointer to...
+ Continuing in a spiral fashion we see the `;', but we haven't visited all tokens, so we continue and finally get to the type `char', so...
``fp is a pointer to a function passing an int and a pointer to float returning a pointer to a char''
 *Example #3: The ``Ultimate''*
#+begin_src c
                      +-----------------------------+
                      |                  +---+      |
                      |  +---+           |+-+|      |
                      |  ^   |           |^ ||      |
                void (*signal(int, void (*fp)(int)))(int);
                 ^    ^      |      ^    ^  ||      |
                 |    +------+      |    +--+|      |
                 |                  +--------+      |
                 +----------------------------------+
#+end_src
Question we ask ourselves: What is `signal'?

Notice that signal is inside parenthesis, so we must resolve this first!

+ Moving in a clockwise direction we see `(' so we have...
 ``signal is a function passing an int and a...
+ Hmmm, we can use this same rule on `fp', so... What is fp? fp is also inside parenthesis so continuing we see an `*', so...
 fp is a pointer to...
+ Continue in a spiral clockwise direction and we get to `(', so...
 ``fp is a pointer to a function passing int returning...''
+ Now we continue out of the function parenthesis and we see void, so...
 ``fp is a pointer to a function passing int returning nothing (void)''
+ We have finished with fp so let's catch up with `signal', we now have...
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning...
+ We are still inside parenthesis so the next character seen is a `*', so...
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to...
+ We have now resolved the items within parenthesis, so continuing clockwise, we then see another `(', so...
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to a function passing an int returning...
+ Finally we continue and the only thing left is the word `void', so the final complete definition for signal is:
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to a function passing an int returning nothing (void)''

The same rule is applied for const and volatile. For Example:

	=const char *chptr;=
+ Now, what is chptr??
``chptr is a pointer to a char constant''

How about this one:

	char * const chptr;
+ Now, what is chptr??
``chptr is a constant pointer to char''

Finally:

	volatile char * const chptr;
+ Now, what is chptr??
``chptr is a constant pointer to a char volatile.''
