src/C-C++/C FAQ Notes.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Q1.21  How do I construct declarations of complicated types such as ``array of N pointers to functions returning pointers to functions returning pointers to char'', or figure out what similarly complicated declarations mean?</h3>
<div class="outline-text-3" id="text-1-5">


<ol>
<li><code>char *(*(*a[N])())();</code>
</li>
</ol>

<p>Build the declaration up incrementally, using <code>typedefs</code>:
</p>


<pre class="src src-c"><span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">char</span> *<span style="color: #98fb98;">pc</span>;       <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">pointer to char </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">pc</span> <span style="color: #98fb98;">fpc</span>();       <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">function returning pointer to char </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">fpc</span> *<span style="color: #98fb98;">pfpc</span>;      <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">pointer to above </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">pfpc</span> <span style="color: #98fb98;">fpfpc</span>();   <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">function returning... </span><span style="color: #ff7f24;">*/</span>
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">fpfpc</span> *<span style="color: #98fb98;">pfpfpc</span>;  <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">pointer to... </span><span style="color: #ff7f24;">*/</span>
<span style="color: #98fb98;">pfpfpc</span> <span style="color: #eedd82;">a</span>[N];            <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">array of... </span><span style="color: #ff7f24;">*/</span>
</pre>

<p>
Use the <b>cdecl</b> program, which turns English into C and vice versa.
You provide a longhand description of the type you want, and cdecl
responds with the equivalent C declaration:
</p>


<pre class="src src-sh">cdecl&gt; declare a as array of pointer to <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">returning</span>
        pointer to <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">returning</span> pointer to char

char *(*(*a[])())()
</pre>

<p>
 <b>cdecl</b> can also explain complicated declarations (you give it a
complicated declaration and it responds with an English description),
help with casts, and indicate which set of parentheses the parameters
go in (for complicated function definitions, like the one above).
</p>
<p>
One way to make sense of complicated C declarations is by reading them
``inside out,'' remembering that [] and () bind more tightly than *.
For example, given
</p>
<p>
        <code>char *(*pfpc)();</code>
</p>
<p>
we can see that pfpc is a pointer (the inner *) to a function (the ())
to a pointer (the outer *) to char. When we later use pfpc, the
expression *(*pfpc)() (the value pointed to by the return value of a
function pointed to by pfpc) will be a char.
</p>
<p>
Another way of analyzing these declarations is to decompose the
declarator while composing the description, maintaining the
``declaration mimics use'' relationship: 
</p>


<pre class="src src-c">*(*pfpc)()      is a    <span style="color: #98fb98;">char</span>
(*<span style="color: #87cefa;">pfpc</span>)()       is a    pointer to <span style="color: #98fb98;">char</span>
(*<span style="color: #eedd82;">pfpc</span>) is a    function returning pointer to <span style="color: #98fb98;">char</span>
<span style="color: #eedd82;">pfpc</span>    is a    pointer to function returning pointer to <span style="color: #98fb98;">char</span>
</pre>

<p>
If you'd like to make things clearer when declaring complicated types
        like these, you can make the analysis explicit by using a
        chain of typedefs as in option 2 above.
 <b>Additional links:</b>
David Anderson's <a href="http://c-faq.com/decl/spiral.anderson.html">``Clockwise/Spiral Rule''</a>
</p>
<p>
There is a technique known as the ``Clockwise/Spiral Rule'' which
enables any C programmer to parse in their head any C declaration!
</p>
<p>
There are three simple steps to follow:
</p>
<ol>
<li>Starting with the unknown element, move in a spiral/clockwise direction; when ecountering the following elements replace them with the corresponding english statements:
</li>
</ol>

<p>[X] or []
=&gt; Array X size of&hellip; or Array undefined size of&hellip;
(type1, type2)
<code>&gt; function passing type1 and type2 returning... =*</code>
=&gt; pointer(s) to&hellip;
</p><ol>
<li>Keep doing this in a spiral/clockwise direction until all tokens have been covered.
</li>
<li>Always resolve anything in parenthesis first!
 <b>Example #1: Simple declaration</b>
</li>
</ol>




<pre class="src src-sh">     +-------+
     | +-+   |
     | ^ |   |
char *str[10];
 ^   ^   |   |
 |   +---+   |
 +-----------+
</pre>

<p>
Question we ask ourselves: What is str?
</p>
<p>
``str is an&hellip;
</p><ul>
<li>We move in a spiral clockwise direction starting with `str' and the first character we see is a `[' so, that means we have an array, so&hellip;
</li>
</ul>

<p>``str is an array 10 of&hellip;
</p><ul>
<li>Continue in a spiral clockwise direction, and the next thing we encounter is the `*' so, that means we have pointers, so&hellip;
</li>
</ul>

<p>``str is an array 10 of pointers to&hellip;
</p><ul>
<li>Continue in a spiral direction and we see the end of the line (the `;'), so keep going and we get to the type `char', so&hellip;
</li>
</ul>

<p>``str is an array 10 of pointers to char''
</p><ul>
<li>We have now ``visited'' every token; therefore we are done!
 <b>Example #2: Pointer to Function declaration</b>
</li>
</ul>




<pre class="src src-c">     +--------------------+
     | +---+              |
     | |+-+|              |
     | |^ ||              |
<span style="color: #98fb98;">char</span> *(*fp)( <span style="color: #98fb98;">int</span>, <span style="color: #98fb98;">float</span> *);
 ^   ^ ^  ||              |
 |   | +--+|              |
 |   +-----+              |
 +------------------------+
</pre>

<p>
Question we ask ourselves: What is fp?
</p>
<p>
``fp is a&hellip;
</p><ul>
<li>Moving in a spiral clockwise direction, the first thing we see is a `)'; therefore, fp is inside parenthesis, so we continue the spiral inside the parenthesis and the next character seen is the `*', so&hellip;
</li>
</ul>

<p>``fp is a pointer to&hellip;
</p><ul>
<li>We are now out of the parenthesis and continuing in a spiral clockwise direction, we see the `('; therefore, we have a function, so&hellip;
</li>
</ul>

<p>``fp is a pointer to a function passing an int and a pointer to float returning&hellip;
</p><ul>
<li>Continuing in a spiral fashion, we then see the `*' character, so&hellip;
</li>
</ul>

<p>``fp is a pointer to a function passing an int and a pointer to float returning a pointer to&hellip;
</p><ul>
<li>Continuing in a spiral fashion we see the `;', but we haven't visited all tokens, so we continue and finally get to the type `char', so&hellip;
</li>
</ul>

<p>``fp is a pointer to a function passing an int and a pointer to float returning a pointer to a char''
 *Example #3: The ``Ultimate''*
</p>


<pre class="src src-c">      +-----------------------------+
      |                  +---+      |
      |  +---+           |+-+|      |
      |  ^   |           |^ ||      |
<span style="color: #98fb98;">void</span> (*signal(<span style="color: #98fb98;">int</span>, <span style="color: #98fb98;">void</span> (*<span style="color: #eedd82;">fp</span>)(<span style="color: #98fb98;">int</span>)))(<span style="color: #98fb98;">int</span>);
 ^    ^      |      ^    ^  ||      |
 |    +------+      |    +--+|      |
 |                  +--------+      |
 +----------------------------------+
</pre>

<p>
Question we ask ourselves: What is `signal'?
</p>
<p>
Notice that signal is inside parenthesis, so we must resolve this first!
</p>
<ul>
<li>Moving in a clockwise direction we see `(' so we have&hellip;
 ``signal is a function passing an int and a&hellip;
</li>
<li>Hmmm, we can use this same rule on `fp', so&hellip; What is fp? fp is also inside parenthesis so continuing we see an `*', so&hellip;
 fp is a pointer to&hellip;
</li>
<li>Continue in a spiral clockwise direction and we get to `(', so&hellip;
 ``fp is a pointer to a function passing int returning&hellip;''
</li>
<li>Now we continue out of the function parenthesis and we see void, so&hellip;
 ``fp is a pointer to a function passing int returning nothing (void)''
</li>
<li>We have finished with fp so let's catch up with `signal', we now have&hellip;
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning&hellip;
</li>
<li>We are still inside parenthesis so the next character seen is a `*', so&hellip;
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to&hellip;
</li>
<li>We have now resolved the items within parenthesis, so continuing clockwise, we then see another `(', so&hellip;
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to a function passing an int returning&hellip;
</li>
<li>Finally we continue and the only thing left is the word `void', so the final complete definition for signal is:
 ``signal is a function passing an int and a pointer to a function passing an int returning nothing (void) returning a pointer to a function passing an int returning nothing (void)''
</li>
</ul>


<p>
The same rule is applied for const and volatile. For Example:
</p>
<p>
        <code>const char *chptr;</code>
</p><ul>
<li>Now, what is chptr??
</li>
</ul>

<p>``chptr is a pointer to a char constant''
</p>
<p>
How about this one:
</p>
<p>
        char * const chptr;
</p><ul>
<li>Now, what is chptr??
</li>
</ul>

<p>``chptr is a constant pointer to char''
</p>
<p>
Finally:
</p>
<p>
        volatile char * const chptr;
</p><ul>
<li>Now, what is chptr??
</li>
</ul>

<p>``chptr is a constant pointer to a char volatile.''
</p></div>

</div>
