src/C-C++/C FAQ Notes.org
** Q1.29 How can I determine which identifiers are safe for me to use and which are reserved?
What do the above rules really mean? If you want to be on the safe side:

1,2. Don't give anything a name with a leading underscore.
3. Don't give anything a name which is already a standard macro (including the ``future directions'' patterns).
4. Don't give any functions or global variables names which are already taken by functions or variables in the standard library, or which match any of the ``future directions'' patterns. (Strictly speaking, ``matching'' means matching in the first six characters, without regard to case; see question 11.27.)
5. Don't redefine standard typedef or tag names.

In fact, the preceding subparagraphs are overly conservative. If you wish, you may remember the following exceptions:

1,2. You may use identifiers consisting of an underscore followed by a digit or lower case letter for labels and structure/union members.
1,2. You may use identifiers consisting of an underscore followed by a digit or lower case letter at function, block, or prototype scope.
3. You may use names matching standard macro names if you don't #include any header files which #define them.
4. You may use names of standard library routines as static or local variables (strictly speaking, as identifiers with internal or no linkage).
5. You may use standard typedef and tag names if you don't #include any header files which declare them.

However, before making use of any of these exceptions, recognize that
some of them are pretty risky (especially exceptions 3 and 5, since
you could accidentally #include the relevant header file at a later
time, perhaps through a chain of nested #include files), and others
(especially the ones labeled 1,2) represent sort of a ``no man's
land'' between the user namespaces and the namespaces reserved to the
implementation.
* 2. Structures, Unions, and Enumerations
** Q2.6  I came across some code that declared a structure like this:
#+begin_src c
struct name {
	int namelen;
	char namestr[1];
};
#+end_src
and then did some tricky allocation to make the =namestr= array act like
	it had several elements, with the number recorded by namelen.
	How does this work? Is it legal or portable?

An implementation of the technique might look something like this:
#+begin_src c
#include <stdlib.h>
#include <string.h>

struct name *makename(char *newname)
{
	struct name *ret =
		malloc(sizeof(struct name)-1 + strlen(newname)+1);
				/* -1 for initial [1]; +1 for \0 */
	if(ret != NULL) {
		ret->namelen = strlen(newname);
		strcpy(ret->namestr, newname);
	}

	return ret;
}
#+end_src
This function allocates an instance of the name structure with the
size adjusted so that the namestr field can hold the requested name
(not just one character, as the structure declaration would suggest).

Another possibility is to declare the variable-size element very
large, rather than very small. The above example could be rewritten
like this:

#+begin_src c
#include <stdlib.h>
#include <string.h>

#define MAXSIZE 100

struct name {
	int namelen;
	char namestr[MAXSIZE];
};

struct name *makename(char *newname)
{
	struct name *ret =
		malloc(sizeof(struct name)-MAXSIZE+strlen(newname)+1);
								/* +1 for \0 */
	if(ret != NULL) {
		ret->namelen = strlen(newname);
		strcpy(ret->namestr, newname);
	}

	return ret;
}
#+end_src
where MAXSIZE is larger than any name which will be stored. 

Of course, to be truly safe, the right thing to do is use a character
pointer instead of an array:
#+begin_src c
#include <stdlib.h>
#include <string.h>

struct name {
	int namelen;
	char *namep;
};

struct name *makename(char *newname)
{
	struct name *ret = malloc(sizeof(struct name));
	if(ret != NULL) {
		ret->namelen = strlen(newname);
		ret->namep = malloc(ret->namelen + 1);
		if(ret->namep == NULL) {
			free(ret);
			return NULL;
		}
		strcpy(ret->namep, newname);
	}

	return ret;
}
#+end_src 
(Obviously, the ``convenience'' of having the length and the string
stored in the same block of memory has now been lost, and freeing
instances of this structure will require two calls to free; see
question 7.23.)
** Q2.10 How can I pass constant values to functions which accept structure arguments? How can I create nameless, immediate, constant structure values?
C99 introduces ``compound literals'', one form of which provides for structure constants. For example, to pass a constant coordinate pair to a hypothetical plotpoint function which expects a struct point, you can call

	=plotpoint((struct point){1, 2});=
Combined with ``designated initializers'' (another C99 feature), it is also possible to specify member values by name:
	=plotpoint((struct point){.x=1, .y=2});=
** Q2.11 How can I read/write structures from/to data files?
It is relatively straightforward to write a structure out using fwrite:

	=fwrite(&somestruct, sizeof somestruct, 1, fp);=
and a corresponding =fread= invocation can read it back in. What happens
here is that =fwrite= receives a pointer to the structure, and writes
(or =fread= correspondingly reads) the memory image of the structure as
a stream of bytes. The sizeof operator determines how many bytes the
structure occupies.

However, data files written as memory images in this way will not be
portable, particularly if they contain floating-point fields or
pointers. The memory layout of structures is machine and compiler
dependent. Different compilers may use different amounts of padding
(see question 2.12), and the sizes and byte orders of fundamental
types vary across machines.
