src/C-C++/C FAQ Notes.html

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Q1.29 How can I determine which identifiers are safe for me to use and which are reserved?</h3>
<div class="outline-text-3" id="text-1-6">

<p>What do the above rules really mean? If you want to be on the safe side:
</p>
<p>
1,2. Don't give anything a name with a leading underscore.
</p><ol>
<li>Don't give anything a name which is already a standard macro (including the ``future directions'' patterns).
</li>
<li>Don't give any functions or global variables names which are already taken by functions or variables in the standard library, or which match any of the ``future directions'' patterns. (Strictly speaking, ``matching'' means matching in the first six characters, without regard to case; see question 11.27.)
</li>
<li>Don't redefine standard typedef or tag names.
</li>
</ol>


<p>
In fact, the preceding subparagraphs are overly conservative. If you wish, you may remember the following exceptions:
</p>
<p>
1,2. You may use identifiers consisting of an underscore followed by a digit or lower case letter for labels and structure/union members.
1,2. You may use identifiers consisting of an underscore followed by a digit or lower case letter at function, block, or prototype scope.
</p><ol>
<li>You may use names matching standard macro names if you don't #include any header files which #define them.
</li>
<li>You may use names of standard library routines as static or local variables (strictly speaking, as identifiers with internal or no linkage).
</li>
<li>You may use standard typedef and tag names if you don't #include any header files which declare them.
</li>
</ol>


<p>
However, before making use of any of these exceptions, recognize that
some of them are pretty risky (especially exceptions 3 and 5, since
you could accidentally #include the relevant header file at a later
time, perhaps through a chain of nested #include files), and others
(especially the ones labeled 1,2) represent sort of a ``no man's
land'' between the user namespaces and the namespaces reserved to the
implementation.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2. Structures, Unions, and Enumerations</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Q2.6  I came across some code that declared a structure like this:</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-c"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> {
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">namelen</span>;
        <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">namestr</span>[1];
};
</pre>

<p>
and then did some tricky allocation to make the <code>namestr</code> array act like
        it had several elements, with the number recorded by namelen.
        How does this work? Is it legal or portable?
</p>
<p>
An implementation of the technique might look something like this:
</p>


<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdlib.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;string.h&gt;</span>

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #87cefa;">makename</span>(<span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">newname</span>)
{
        <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #eedd82;">ret</span> =
                malloc(<span style="color: #00ffff;">sizeof</span>(<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span>)-1 + strlen(newname)+1);
                                <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">-1 for initial [1]; +1 for \0 </span><span style="color: #ff7f24;">*/</span>
        <span style="color: #00ffff;">if</span>(ret != <span style="color: #7fffd4;">NULL</span>) {
                ret-&gt;namelen = strlen(newname);
                strcpy(ret-&gt;namestr, newname);
        }

        <span style="color: #00ffff;">return</span> ret;
}
</pre>

<p>
This function allocates an instance of the name structure with the
size adjusted so that the namestr field can hold the requested name
(not just one character, as the structure declaration would suggest).
</p>
<p>
Another possibility is to declare the variable-size element very
large, rather than very small. The above example could be rewritten
like this:
</p>



<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdlib.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;string.h&gt;</span>

<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">MAXSIZE</span> 100

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> {
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">namelen</span>;
        <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">namestr</span>[MAXSIZE];
};

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #87cefa;">makename</span>(<span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">newname</span>)
{
        <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #eedd82;">ret</span> =
                malloc(<span style="color: #00ffff;">sizeof</span>(<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span>)-MAXSIZE+strlen(newname)+1);
                                                                <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">+1 for \0 </span><span style="color: #ff7f24;">*/</span>
        <span style="color: #00ffff;">if</span>(ret != <span style="color: #7fffd4;">NULL</span>) {
                ret-&gt;namelen = strlen(newname);
                strcpy(ret-&gt;namestr, newname);
        }

        <span style="color: #00ffff;">return</span> ret;
}
</pre>

<p>
where MAXSIZE is larger than any name which will be stored. 
</p>
<p>
Of course, to be truly safe, the right thing to do is use a character
pointer instead of an array:
</p>


<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdlib.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;string.h&gt;</span>

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> {
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">namelen</span>;
        <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">namep</span>;
};

<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #87cefa;">makename</span>(<span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">newname</span>)
{
        <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span> *<span style="color: #eedd82;">ret</span> = malloc(<span style="color: #00ffff;">sizeof</span>(<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">name</span>));
        <span style="color: #00ffff;">if</span>(ret != <span style="color: #7fffd4;">NULL</span>) {
                ret-&gt;namelen = strlen(newname);
                ret-&gt;namep = malloc(ret-&gt;namelen + 1);
                <span style="color: #00ffff;">if</span>(ret-&gt;namep == <span style="color: #7fffd4;">NULL</span>) {
                        free(ret);
                        <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">NULL</span>;
                }
                strcpy(ret-&gt;namep, newname);
        }

        <span style="color: #00ffff;">return</span> ret;
}
</pre>

<p>
(Obviously, the ``convenience'' of having the length and the string
stored in the same block of memory has now been lost, and freeing
instances of this structure will require two calls to free; see
question 7.23.)
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Q2.10 How can I pass constant values to functions which accept structure arguments? How can I create nameless, immediate, constant structure values?</h3>
<div class="outline-text-3" id="text-2-2">

<p>C99 introduces ``compound literals'', one form of which provides for structure constants. For example, to pass a constant coordinate pair to a hypothetical plotpoint function which expects a struct point, you can call
</p>
<p>
        <code>plotpoint((struct point){1, 2});</code>
Combined with ``designated initializers'' (another C99 feature), it is also possible to specify member values by name:
        <code>plotpoint((struct point){.x=1, .y=2});</code>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Q2.11 How can I read/write structures from/to data files?</h3>
<div class="outline-text-3" id="text-2-3">

<p>It is relatively straightforward to write a structure out using fwrite:
</p>
<p>
        <code>fwrite(&amp;somestruct, sizeof somestruct, 1, fp);</code>
and a corresponding <code>fread</code> invocation can read it back in. What happens
here is that <code>fwrite</code> receives a pointer to the structure, and writes
(or <code>fread</code> correspondingly reads) the memory image of the structure as
a stream of bytes. The sizeof operator determines how many bytes the
structure occupies.
</p>
<p>
However, data files written as memory images in this way will not be
portable, particularly if they contain floating-point fields or
pointers. The memory layout of structures is machine and compiler
dependent. Different compilers may use different amounts of padding
(see question 2.12), and the sizes and byte orders of fundamental
types vary across machines.
</p></div>

</div>
