src/C-C++/C FAQ Notes.org
** Q2.12 Why is my compiler leaving holes in structures, wasting space and preventing ``binary'' I/O to external data files? Can I turn this off, or otherwise control the alignment of structure fields?
Additional [[http://c-faq.com/struct/align.esr.html][ideas on working with alignment and padding]] by Eric Raymond, couched in the form of six new FAQ list questions 

Corrections to the above from [[http://c-faq.com/struct/align.esr2.html][Norm Diamond]] and [[http://c-faq.com/struct/align.esr3.html][Clive Feather]]
** Q2.14 How can I determine the byte offset of a field within a structure?
 ANSI C defines the =offsetof()= macro in =<stddef.h>=, which lets you
 compute the offset of field f in struct s as offsetof(struct s, f).
 If for some reason you have to code this sort of thing yourself, one
 possibility is
#+begin_src c
	#define offsetof(type, f) ((size_t) \
		((char *)&((type *)0)->f - (char *)(type *)0))
#+end_src
This implementation is not 100% portable; some compilers may
legitimately refuse to accept it.
** Q2.21 Is there an automatic way to keep track of which field of a union is in use?
No. You can implement an explicitly ``tagged'' union yourself:
#+begin_src c 
struct taggedunion {
	enum {UNKNOWN, INT, LONG, DOUBLE, POINTER} code;
	union {
		int i;
		long l;
		double d;
		void *p;
	} u;
};
#+end_src 
** Q2.25 I came across some structure declarations with colons and numbers next to certain fields, like this:
#+begin_src c
struct record {
	char *name;
	int refcount : 4;
	unsigned dirty : 1;
};
#+end_src
What gives?

 Those are bit-fields; the number gives the exact size of the field,
 in bits.

*** Example 1
Consider the example of reading the components of a floating-point number. A 4-byte floating-point number in the IEEE 754 standard consists of the following:

= The first bit is reserved for the sign bit — it is 1 if the number is negative and 0 if it is positive.
+ The next 8 bits are used to store the exponent in the unsigned form. When treated as a signed exponent, this exponent value ranges from -127 to +128. When treated as an unsigned value, its value ranges from 0 to 255.
+ The remaining 23 bits are used to store the mantissa.

Here is a program to print the value of a floating-point number into
its constituents:
#+begin_src c
struct FP {
// the order of the members depends on the
// endian scheme of the underlying machine
      unsigned int mantissa : 23;
     unsigned int exponent : 8;
      unsigned int sign : 1;
} *fp;
 
int main() {
       float f = -1.0f;
       fp = (struct FP *)&f;
 
printf(" sign = %s, biased exponent = %u,
mantissa = %u ", fp->sign ? "negative" : "positive",
fp->exponent, fp->mantissa);
}
#+end_src 
For the floating-point number -1.0, this program prints:

=sign = negative, biased exponent = 127, mantissa = 0=

Since the sign of the floating-point number is negative, the value of
the sign bit is 1. Since the exponent is actual 0, in unsigned
exponent format, it is represented as 127, and hence that value is
printed. The mantissa in this case is 0, and hence it is printed as it
is.

To understand how floating-point arithmetic works, see this [[http://en.wikipedia.org/wiki/Single_precision][Wikipedia article]].
*** Example 2
#+begin_src c
struct bitfield {
    int bit : 1;
} BIT;
int main() {
   BIT.bit = 1;
   printf(" sizeof BIT is = %d\n", sizeof(BIT));
   printf(" value of bit is = %d ", BIT.bit);
 
}
#+end_src
It prints:
#+begin_src c
 sizeof BIT is = 4
 value of bit is = -1
#+end_src
Note that we declared bit as int bit : 1; where the compiler treated the bit to be a signed integer of one bit size. Now, what is the range of a 1-bit signed integer?

It is from 0 to -1 (not 0 and 1, which is a common mistake). Remember
the formula for finding out the range of signed integers: 2^(n-1) to
2^(n-1)-1 where N is the number of bits. For example, if N is 8 (number
of bits in a byte), i.e., the range of a signed integer of size 8 is
-2^(8-1) to 2^(8-1)-1, which is -128 to +127. Now, when N is 1, i.e.,
the range of a signed integer of size 1, it is -2^(1-1) to 2^(1-1)-1,
which is -1 to 0!

* 3. Expressions
** Q
* Footnotes

[fn:1] http://en.wikibooks.org/wiki/C_Programming/C_Reference/inttypes.h#cite_note-2


