src/C-C++/C FAQ Notes.html

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Q2.12 Why is my compiler leaving holes in structures, wasting space and preventing ``binary'' I/O to external data files? Can I turn this off, or otherwise control the alignment of structure fields?</h3>
<div class="outline-text-3" id="text-2-4">

<p>Additional <a href="http://c-faq.com/struct/align.esr.html">ideas on working with alignment and padding</a> by Eric Raymond, couched in the form of six new FAQ list questions 
</p>
<p>
Corrections to the above from <a href="http://c-faq.com/struct/align.esr2.html">Norm Diamond</a> and <a href="http://c-faq.com/struct/align.esr3.html">Clive Feather</a>
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Q2.14 How can I determine the byte offset of a field within a structure?</h3>
<div class="outline-text-3" id="text-2-5">

<p> ANSI C defines the <code>offsetof()</code> macro in <code>&lt;stddef.h&gt;</code>, which lets you
 compute the offset of field f in struct s as offsetof(struct s, f).
 If for some reason you have to code this sort of thing yourself, one
 possibility is
</p>


<pre class="src src-c"><span style="color: #b0c4de;">#define</span> <span style="color: #87cefa;">offsetof</span>(<span style="color: #eedd82;">type</span>, <span style="color: #eedd82;">f</span>) ((<span style="color: #98fb98;">size_t</span>) \
        ((<span style="color: #98fb98;">char</span> *)&amp;((<span style="color: #98fb98;">type</span> *)0)-&gt;f - (<span style="color: #98fb98;">char</span> *)(<span style="color: #98fb98;">type</span> *)0))
</pre>

<p>
This implementation is not 100% portable; some compilers may
legitimately refuse to accept it.
</p></div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6">Q2.21 Is there an automatic way to keep track of which field of a union is in use?</h3>
<div class="outline-text-3" id="text-2-6">

<p>No. You can implement an explicitly ``tagged'' union yourself:
</p>


<pre class="src src-c"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">taggedunion</span> {
        <span style="color: #00ffff;">enum</span> {<span style="color: #eedd82;">UNKNOWN</span>, <span style="color: #eedd82;">INT</span>, <span style="color: #eedd82;">LONG</span>, <span style="color: #eedd82;">DOUBLE</span>, <span style="color: #eedd82;">POINTER</span>} <span style="color: #eedd82;">code</span>;
        <span style="color: #00ffff;">union</span> {
                <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span>;
                <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">l</span>;
                <span style="color: #98fb98;">double</span> <span style="color: #eedd82;">d</span>;
                <span style="color: #98fb98;">void</span> *<span style="color: #eedd82;">p</span>;
        } <span style="color: #eedd82;">u</span>;
};
</pre>

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7">Q2.25 I came across some structure declarations with colons and numbers next to certain fields, like this:</h3>
<div class="outline-text-3" id="text-2-7">




<pre class="src src-c"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">record</span> {
        <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">name</span>;
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">refcount</span> : 4;
        <span style="color: #98fb98;">unsigned</span> <span style="color: #eedd82;">dirty</span> : 1;
};
</pre>

<p>
What gives?
</p>
<p>
 Those are bit-fields; the number gives the exact size of the field,
 in bits.
</p>
<ul>
<li id="sec-2-7-1">Example 1<br/>
Consider the example of reading the components of a floating-point number. A 4-byte floating-point number in the IEEE 754 standard consists of the following:

<p>
= The first bit is reserved for the sign bit — it is 1 if the number is negative and 0 if it is positive.
</p><ul>
<li>The next 8 bits are used to store the exponent in the unsigned form. When treated as a signed exponent, this exponent value ranges from -127 to +128. When treated as an unsigned value, its value ranges from 0 to 255.
</li>
<li>The remaining 23 bits are used to store the mantissa.
</li>
</ul>


<p>
Here is a program to print the value of a floating-point number into
its constituents:
</p>


<pre class="src src-c"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">FP</span> {
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">the order of the members depends on the</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">endian scheme of the underlying machine</span>
      <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">mantissa</span> : 23;
     <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">exponent</span> : 8;
      <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sign</span> : 1;
} *<span style="color: #eedd82;">fp</span>;

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
       <span style="color: #98fb98;">float</span> <span style="color: #eedd82;">f</span> = -1.0f;
       fp = (<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">FP</span> *)&amp;f;

printf(<span style="color: #ffc0cb; font-weight: bold;">"</span><span style="color: #ffa07a;"> sign = %s, biased exponent = %u,</span>
<span style="color: #ffa07a;">mantissa = %u "</span>, fp-&gt;sign ? <span style="color: #ffa07a;">"negative"</span> : <span style="color: #ffa07a;">"positive"</span>,
fp-&gt;exponent, fp-&gt;mantissa);
}
</pre>

<p>
For the floating-point number -1.0, this program prints:
</p>
<p>
<code>sign = negative, biased exponent = 127, mantissa = 0</code>
</p>
<p>
Since the sign of the floating-point number is negative, the value of
the sign bit is 1. Since the exponent is actual 0, in unsigned
exponent format, it is represented as 127, and hence that value is
printed. The mantissa in this case is 0, and hence it is printed as it
is.
</p>
<p>
To understand how floating-point arithmetic works, see this <a href="http://en.wikipedia.org/wiki/Single_precision">Wikipedia article</a>.
</p></li>
</ul>
<ul>
<li id="sec-2-7-2">Example 2<br/>



<pre class="src src-c"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">bitfield</span> {
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">bit</span> : 1;
} <span style="color: #eedd82;">BIT</span>;
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
   BIT.bit = 1;
   printf(<span style="color: #ffa07a;">" sizeof BIT is = %d\n"</span>, <span style="color: #00ffff;">sizeof</span>(BIT));
   printf(<span style="color: #ffa07a;">" value of bit is = %d "</span>, BIT.bit);

}
</pre>

<p>
It prints:
</p>


<pre class="src src-c"><span style="color: #00ffff;">sizeof</span> BIT is = 4
value of bit is = -1
</pre>

<p>
Note that we declared bit as int bit : 1; where the compiler treated the bit to be a signed integer of one bit size. Now, what is the range of a 1-bit signed integer?
</p>
<p>
It is from 0 to -1 (not 0 and 1, which is a common mistake). Remember
the formula for finding out the range of signed integers: 2<sup>(n-1)</sup> to
2<sup>(n-1)</sup>-1 where N is the number of bits. For example, if N is 8 (number
of bits in a byte), i.e., the range of a signed integer of size 8 is
-2(8-1) to 2(8-1)-1, which is -128 to +127. Now, when N is 1, i.e.,
the range of a signed integer of size 1, it is -2(1-1) to 2(1-1)-1,
which is -1 to 0!
</p>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3. Expressions</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Q</h3>
<div class="outline-text-3" id="text-3-1">


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> <a href="http://en.wikibooks.org/wiki/C_Programming/C_Reference/inttypes.h#cite_note-2">http://en.wikibooks.org/wiki/C_Programming/C_Reference/inttypes.h#cite_note-2</a>
</p></div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-12 12:34:52 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
